justinlindh/bramble/sdkconfig.defaults
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_MBEDTLS_HARDWARE_AES=y
CONFIG_MBEDTLS_HARDWARE_SHA=y
CONFIG_MBEDTLS_HARDWARE_MPI=y
CONFIG_MBEDTLS_HKDF_C=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_IDF_TARGET="esp32s3"
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=5
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=n
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=n
CONFIG_HTTPD_WS_SUPPORT=y
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
# BLE — NimBLE stack
# BLE disabled by default across current profiles (WiFi-first)
# CONFIG_BT_ENABLED is not set
# CONFIG_BT_NIMBLE_ENABLED is not set
CONFIG_BT_CONTROLLER_DISABLED=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=2
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=256
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=n
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_NVS_PERSIST=y

# Message persistence defaults (Heltec/local)
CONFIG_BRAMBLE_MSG_PERSIST_ENABLED=y
CONFIG_BRAMBLE_MSG_PERSIST_MAX=120
CONFIG_BRAMBLE_MSG_PERSIST_ROLLOVER_KEEP_PCT=75

# Default board (overridden by board-specific defaults files)
# NOTE: Heltec V3 uses CP2102 UART bridge — console stays on UART (default).
# T-Deck Plus and Heltec V4 use native USB-JTAG — console overridden in their
# board-specific sdkconfig.defaults.* files.
CONFIG_BRAMBLE_RPC_MAX_METHODS=64

# OTA image signing: Secure Boot V2 RSA-3072 app signatures WITHOUT eFuses.
# Every build appends a signature block to bramble.bin; OTA updates verify the
# incoming image against the public key in the RUNNING app's signature block
# and fail closed (esp_ota_end / esp_https_ota_finish). Boot-time enforcement
# arrives later with hardware Secure Boot V2 (eFuse burn, human-gated); the
# image format is already compatible.
# The main task is also the text-UI task on non-LVGL boards (render_screen runs
# in it), and the SAS verification render path derives an HKDF-based safety
# number (mbedtls SHA256/HMAC contexts are stack-heavy). The 3584-byte IDF
# default overflows on real hardware at boot; give every board the same 8192
# the T-Deck already uses.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_SECURE_SIGNED_APPS_NO_SECURE_BOOT=y
CONFIG_SECURE_SIGNED_APPS_RSA_SCHEME=y
CONFIG_SECURE_SIGNED_ON_UPDATE_NO_SECURE_BOOT=y
CONFIG_SECURE_BOOT_BUILD_SIGNED_BINARIES=y
CONFIG_SECURE_BOOT_SIGNING_KEY="keys/ota_signing_key.pem"
